---
kind: method
id: M:Autodesk.Revit.DB.Lighting.BasicLossFactor.#ctor(Autodesk.Revit.DB.Lighting.BasicLossFactor)
source: html/ef6a7b63-7cd0-2179-8412-39daace72274.htm
---
# Autodesk.Revit.DB.Lighting.BasicLossFactor.#ctor Method

Creates a copy of the given basic loss factor object

## Syntax (C#)
```csharp
public BasicLossFactor(
	BasicLossFactor other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Lighting.BasicLossFactor`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null